<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class Holidays extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //
$holidays = [
            ['id' => 1, 'date' => '2025-01-01', 'description' => 'ទិវាចូលឆ្នាំសាកល'],
            ['id' => 2, 'date' => '2025-01-07', 'description' => 'ទិវាជ័យជំនះលើរបបប្រល័យពូជសាសន៍'],
            ['id' => 3, 'date' => '2025-03-08', 'description' => 'ទិវានារីអន្ដរជាតិ'],
            ['id' => 4, 'date' => '2025-04-14', 'description' => 'ពិធីបុណ្យចូលឆ្នាំថ្មី ប្រពៃណីជាតិ'],
            ['id' => 5, 'date' => '2025-04-15', 'description' => 'ពិធីបុណ្យចូលឆ្នាំថ្មី ប្រពៃណីជាតិ'],
            ['id' => 6, 'date' => '2025-04-16', 'description' => 'ពិធីបុណ្យចូលឆ្នាំថ្មី ប្រពៃណីជាតិ'],
            ['id' => 7, 'date' => '2025-05-01', 'description' => 'ទិវាពលកម្មអន្ដរជាតិ'],
            ['id' => 8, 'date' => '2025-05-11', 'description' => 'ពិធីបុណ្យវិសាខពូជា'],
            ['id' => 9, 'date' => '2025-05-14', 'description' => 'ព្រះរាជពិធីបុណ្យចម្រើនព្រះជន្ម ព្រះករុណាព្រះបាទសម្ដេចព្រះបរមនាថ នរោត្តម សីហមុនី'],
            ['id' => 10, 'date' => '2025-05-15', 'description' => 'ព្រះរាជពិធីច្រត់ព្រះនង្គ័ល'],
            ['id' => 11, 'date' => '2025-06-18', 'description' => 'ព្រះរាជពិធីបុណ្យចម្រើនព្រះជន្ម សម្ដេចព្រះមហាក្សត្រី នរោត្តម មុនិនាថ សីហនុ'],
            ['id' => 12, 'date' => '2025-09-21', 'description' => 'ពិធីបុណ្យភ្ជុំបិណ្ឌ'],
            ['id' => 13, 'date' => '2025-09-22', 'description' => 'ពិធីបុណ្យភ្ជុំបិណ្ឌ'],
            ['id' => 14, 'date' => '2025-09-23', 'description' => 'ពិធីបុណ្យភ្ជុំបិណ្ឌ'],
            ['id' => 15, 'date' => '2025-09-24', 'description' => 'ទិវាប្រកាសរដ្ឋធម្មនុញ្ញ'],
            ['id' => 16, 'date' => '2025-10-15', 'description' => 'ពិធីគោរពព្រះវិញ្ញាណក្ខន្ធ ព្រះករុណាព្រះបាទសម្ដេចព្រះនរោត្តម សីហនុ'],
            ['id' => 17, 'date' => '2025-10-29', 'description' => 'ព្រះរាជពិធីគ្រងព្រះបរមរាជសម្បត្តិរបស់ព្រះបាទសម្ដេចព្រះបរមនាថ នរោត្តម សីហមុនី'],
            ['id' => 18, 'date' => '2025-11-04', 'description' => 'ពិធីបុណ្យអុំទូក បណ្ដែតប្រទីប អកអំបុក សំពះព្រះខែ'],
            ['id' => 19, 'date' => '2025-11-05', 'description' => 'ពិធីបុណ្យអុំទូក បណ្ដែតប្រទីប អកអំបុក សំពះព្រះខែ'],
            ['id' => 20, 'date' => '2025-11-06', 'description' => 'ពិធីបុណ្យអុំទូក បណ្ដែតប្រទីប អកអំបុក សំពះព្រះខែ'],
            ['id' => 21, 'date' => '2025-11-09', 'description' => 'ពិធីបុណ្យឯករាជ្យជាតិ'],
            ['id' => 22, 'date' => '2025-12-29', 'description' => 'ទិវាសន្ដិភាពនៅកម្ពុជា'],
        ];
        
        DB::table('holidays')->insert($holidays);
    }
}
